[
  {
    "id": "travel-tales",
    "title": "Travel Tales",
    "description": "Aplicație web modernă Angular 19 pentru jurnalul personal de călătorii cu interfață intuitivă și vizualizare duală.",
    "longDescription": "Travel Tales este o aplicație web modernă Angular 19 proiectată ca jurnal personal de călătorii. Include interfață intuitivă cu moduri de vizualizare duală (carduri și tabel) pentru documentarea și vizualizarea experiențelor de călătorie. Aplicația suportă operațiuni CRUD complete, încărcare imagini, etichetare personalizată, urmărirea statusului călătoriilor (vizitate/viitoare) și vizualizare geografică. Construită cu TypeScript, RxJS și ng-zorro-antd, include lazy loading, route guards și stilizare SCSS responsive.",
    "image": "./assets/images/projects/travel-tales.png",
    "technologies": ["Angular 19", "TypeScript", "RxJS", "ng-zorro-antd", "SCSS", "Lazy Loading"],
    "githubUrl": "https://github.com/prvu7/MyTrips-with-Angular",
    "demoUrl": null,
    "featured": true,
    "category": "web"
  },
  {
    "id": "enjoy-cafe",
    "title": "Enjoy Café - Site",
    "description": "Aplicație web Angular responsive pentru \"Enjoy Café\" cu arhitectură modulară și sistem de shopping cart.",
    "longDescription": "Aplicație web Angular responsive dezvoltată pentru \"Enjoy Café\" folosind arhitectură modulară cu componente standalone și management de stare bazat pe servicii. Implementează caruseluri de produse dinamice, sistem de shopping cart și navigare cu scroll smooth. Design-ul include meniul de sus sensibil la scroll și notificări pop-up temporare. Folosește SCSS pentru stilizare avansată, animații și design coeziv aliniat cu branding-ul cafenelei.",
    "image": "./assets/images/projects/enjoy-cafe.png",
    "technologies": ["Angular", "TypeScript", "SCSS", "Standalone Components", "Service-based State"],
    "githubUrl": "https://github.com/StefanBalanica/EnjoyCafe-site",
    "demoUrl": null,
    "featured": true,
    "category": "web"
  },
  {
    "id": "calculator-wpf",
    "title": "Calculator Desktop",
    "description": "Aplicație desktop de calculator dezvoltată cu WPF (.NET Framework) și principii MVVM.",
    "longDescription": "Aplicație desktop de calculator dezvoltată cu tehnologia WPF (.NET Framework 4.7.2), implementând interfață modernă și funcționalități avansate precum animații personalizate (cu AnimationHelper), management memorie (MemoryManager) și conversii dinamice de numere (NumberFormatConverter). Folosește principiile MVVM pentru separarea logicii interfeței, cu bindings și notificări de proprietate (INotifyPropertyChanged). Aplicația suportă interacțiuni cu tastatura și mouse, oferind o experiență intuitivă și puternică.",
    "image": "./assets/images/projects/calculator.jpg",
    "technologies": ["WPF", ".NET Framework 4.7.2", "C#", "MVVM", "XAML", "AnimationHelper"],
    "githubUrl": "https://github.com/StefanBalanica/Calculator",
    "demoUrl": null,
    "featured": true,
    "category": "desktop"
  },
  {
    "id": "ether-game",
    "title": "Ether - Joc Strategic",
    "description": "Joc strategic pentru 2 jucători inspirat din X și O și Connect 4, cu reguli extinse și elemente strategice.",
    "longDescription": "Ether este un joc strategic pentru 2 jucători inspirat din X și O și Connect 4, dar cu reguli extinse. Jucătorii plasează cărți numerotate pe o tablă, iar numerele mai mari pot acoperi cele mai mici. Regulile includ elemente strategice precum iluzie, explozie, vrăjitori și puteri magice, oferind o varietate de moduri de joc (practică, dueluri, turnee și viteză). Jocul se termină prin realizarea unei linii câștigătoare, completarea tablei sau epuizarea cărților. Am lucrat la logica programului, funcțiile de bază și afișare, coordonând o echipă de 4 persoane pentru realizarea acestui proiect la facultate.",
    "image": "./assets/images/projects/ether-game.jpg",
    "technologies": ["C++", "Modern C++", "Game Logic", "Team Coordination"],
    "githubUrl": "https://github.com/CostinBangala28/ProjectModernCPP",
    "demoUrl": null,
    "featured": false,
    "category": "other"
  },
  {
    "id": "online-library",
    "title": "Online Library",
    "description": "Proiect de bibliotecă online realizat la facultate cu Java, Spring Boot și interfață web.",
    "longDescription": "Biblioteca online este un proiect realizat în cadrul facultății unde poți vedea cele 5 cărți cele mai recent adăugate în bibliotecă, căuta, șterge sau adăuga cărți. Prin acest proiect am învățat să folosesc Java, framework-ul Spring-Boot, JavaScript, HTML și CSS. Proiectul demonstrează cunoștințele de backend development și integrarea cu frontend-ul web.",
    "image": "./assets/images/projects/online-library.png",
    "technologies": ["Java", "Spring Boot", "JavaScript", "HTML", "CSS", "Backend Development"],
    "githubUrl": "https://github.com/StefanBalanica/Proiect-MIP",
    "demoUrl": null,
    "featured": false,
    "category": "web"
  },
  {
    "id": "x0-genetic-algorithm",
    "title": "X&0 - Genetic Algorithm",
    "description": "Proiect universitar de joc X&0 cu algoritm genetic, dezvoltat în echipă de 4 studenți.",
    "longDescription": "X&0-genetic algorithm este un proiect universitar dezvoltat de o echipă de 4 studenți pe care am coordonat-o. Împreună am dezvoltat un joc de X&0 în care utilizatorul uman joacă împotriva computerului, care învață să joace mai bine și să aibă rate de câștig mai mari din jocurile jucate. Programul este realizat folosind tehnica algoritmului genetic și este scris în limbajul C++. Am lucrat la majoritatea funcțiilor și am avut grijă de organizarea echipei.",
    "image": "./assets/images/projects/ x0-genetic.png",
    "technologies": ["C++", "Genetic Algorithm", "AI", "Team Leadership", "Game Development"],
    "githubUrl": "https://github.com/StefanBalanica/X-0",
    "demoUrl": null,
    "featured": false,
    "category": "other"
  }
]
